[
  {
    "ReadingQuestionId": 7,
    "ReadingLessonId": 2,
    "QuestionNumber": 1,
    "QuestionText": "What is the underlying motivation for Michael Flanagan's hobby?",
    "Option1": "He is looking for a way to earn extra money in his retirement.",
    "Option2": "He is a former police officer who misses solving crimes.",
    "Option3": "He recognises the emotional connection people have to their belongings.",
    "Option4": "He hopes to become a famous blogger and social media personality.",
    "CorrectAnswer": "He recognises the emotional connection people have to their belongings.",
    "Explanation": "The text states his motive is understanding the sentimental value of small objects and returning them, not money or fame.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingQuestionId": 8,
    "ReadingLessonId": 2,
    "QuestionNumber": 2,
    "QuestionText": "What first inspired Michael to start his hobby?",
    "Option1": "He wanted to help after finding something a child had lost.",
    "Option2": "He read a story in the newspaper about a lost dog.",
    "Option3": "He wanted to become a police officer but was too old.",
    "Option4": "He lost his own wallet and someone returned it to him.",
    "CorrectAnswer": "He wanted to help after finding something a child had lost.",
    "Explanation": "Finding a child's mitten and imagining the child inspired him to act and start the blog.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingQuestionId": 9,
    "ReadingLessonId": 2,
    "QuestionNumber": 3,
    "QuestionText": "Michael's 'detective work' can best be described as...",
    "Option1": "a simple system of leaving items where he found them and hoping for the best.",
    "Option2": "a private investigation that respects the owners' anonymity.",
    "Option3": "a methodical search for identifying marks and personal details.",
    "Option4": "examining items for clues and then using the internet to ask for help.",
    "CorrectAnswer": "examining items for clues and then using the internet to ask for help.",
    "Explanation": "He inspects items for names, dates, logos and uses social media and his blog to trace owners.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingQuestionId": 10,
    "ReadingLessonId": 2,
    "QuestionNumber": 4,
    "QuestionText": "The story of the faded photograph serves to highlight...",
    "Option1": "how personal items often end up in unexpected places.",
    "Option2": "the power of social media in solving personal mysteries and connecting people.",
    "Option3": "the importance of keeping family photographs in a safe and secure place.",
    "Option4": "the financial value that some old photographs can have for collectors.",
    "CorrectAnswer": "the power of social media in solving personal mysteries and connecting people.",
    "Explanation": "The photo was reunited with family after being widely shared online, showing social media's role.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingQuestionId": 11,
    "ReadingLessonId": 2,
    "QuestionNumber": 5,
    "QuestionText": "What can be inferred about Michael's character from his approach to his hobby?",
    "Option1": "He is motivated by a desire to do the right thing.",
    "Option2": "He needs a meaningful purpose to fill his retirement years.",
    "Option3": "He is a sociable person who enjoys meeting the people he helps.",
    "Option4": "He is a nostalgic person who prefers the past to the present.",
    "CorrectAnswer": "He is motivated by a desire to do the right thing.",
    "Explanation": "The passage emphasizes his anonymous, integrity-driven motive to return items, not fame or nostalgia.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingQuestionId": 12,
    "ReadingLessonId": 2,
    "QuestionNumber": 6,
    "QuestionText": "What has been an unintended, positive consequence of Michael's blog?",
    "Option1": "It has helped the police to reduce crime in Dublin.",
    "Option2": "It has encouraged other people to get involved in a similar way.",
    "Option3": "It has made him a wealthy and famous person.",
    "Option4": "It has encouraged the city council to install more lost property offices.",
    "CorrectAnswer": "It has encouraged other people to get involved in a similar way.",
    "Explanation": "The text notes his blog created a small community of people who now look out for lost treasures.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  }
]
