[
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 1,
    "QuestionText": "What is the main reason Arthur's clients seek his work?",
    "Option1": "They want something with personality and creative expression.",
    "Option2": "He uses higher quality parchment and ink than his competitors.",
    "Option3": "They are significantly cheaper than satellite imagery.",
    "Option4": "His maps offer greater accuracy than digital versions.",
    "CorrectAnswer": "They want something with personality and creative expression.",
    "Explanation": "Clients value the unique character and artistic quality Arthur puts into his maps.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 2,
    "QuestionText": "What can be inferred about Arthur's client base?",
    "Option1": "They are mainly young people interested in modern technology.",
    "Option2": "They need maps for academic research and documentation.",
    "Option3": "They value the emotional and artistic quality of his work over digital convenience.",
    "Option4": "They are primarily interested in the historical accuracy of the maps.",
    "CorrectAnswer": "They value the emotional and artistic quality of his work over digital convenience.",
    "Explanation": "Arthur’s clients appreciate the artistry and emotional depth rather than modern digital maps.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 3,
    "QuestionText": "Why was Elara's request considered the 'ultimate commission' for Arthur?",
    "Option1": "It gave him the chance to create a famous historical document.",
    "Option2": "It challenged him to work without any existing geographical references.",
    "Option3": "It allowed him to use his most expensive and archaic tools.",
    "Option4": "He had to bring a lost place back to life through storytelling.",
    "CorrectAnswer": "He had to bring a lost place back to life through storytelling.",
    "Explanation": "Arthur wasn’t just mapping land but resurrecting a village through memory and narrative.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 4,
    "QuestionText": "What new information did Elara provide that was not in the original photographs?",
    "Option1": "A list of all the families who used to live there.",
    "Option2": "Her grandfather's memories of certain places and smells.",
    "Option3": "The exact geographical coordinates of the old village.",
    "Option4": "The official town plans from before the reservoir was built.",
    "CorrectAnswer": "Her grandfather's memories of certain places and smells.",
    "Explanation": "Elara added personal details from her grandfather’s memories that photos couldn’t capture.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 5,
    "QuestionText": "The grandfather's reaction to the map primarily demonstrates...",
    "Option1": "the map's power to act as a tangible trigger for lost memories.",
    "Option2": "his sadness at remembering a place he could never return to.",
    "Option3": "his appreciation for having something physical to leave to his family.",
    "Option4": "his desire to check the map for geographical inaccuracies.",
    "CorrectAnswer": "the map's power to act as a tangible trigger for lost memories.",
    "Explanation": "The grandfather recalled forgotten details as he traced the map with his finger.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  },
  {
    "ReadingLessonId": 1,
    "QuestionNumber": 6,
    "QuestionText": "What can be inferred about Arthur's personal philosophy from the text?",
    "Option1": "He plans to incorporate GPS technology into his future work to improve precision.",
    "Option2": "He believes some meaningful things resist modern ways of measuring worth.",
    "Option3": "He feels that his work is no longer relevant in the modern world.",
    "Option4": "He believes modern technology is useless and should be ignored.",
    "CorrectAnswer": "He believes some meaningful things resist modern ways of measuring worth.",
    "Explanation": "Arthur’s smile shows he values the immeasurable qualities of his craft over technology.",
    "IsOption1Selected": false,
    "IsOption2Selected": false,
    "IsOption3Selected": false,
    "IsOption4Selected": false
  }
]
